app/Controllers/Admin/Usuarios.php

    private function buscarUsuarioOu404(int $id = null)
    {

        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) { // REVER ESSA PARTE
---
SELECT *
FROM `usuarios`
WHERE `id` = 4997
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1