app/Models/GrupoUsuarioModel.php

    public function recuperaGruposDoUsuario(int $usuario_id, int $quantidade_paginacao)
    {
        $atributos = [
            'grupos_usuarios.id AS principal_id',
            'grupos.id AS grupo_id',
            'grupos.nome',
            'grupos.descricao'
        ];

        return $this->select($atributos)
                    ->join('grupos', 'grupos.id = grupos_usuarios.grupo_id')
                    ->join('usuarios', 'usuarios.id = grupos_usuarios.usuario_id')
                    ->where('grupos_usuarios.usuario_id', $usuario_id)
                    ->groupBy('grupos.nome')
                    ->paginate($quantidade_paginacao);
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `grupos_usuarios`.`id` AS `principal_id`, `grupos`.`id` AS `grupo_id`, `grupos`.`nome`, `grupos`.`descricao`
FROM `grupos_usuarios`
JOIN `grupos` ON `grupos`.`id` = `grupos_usuarios`.`grupo_id`
JOIN `usuarios` ON `usuarios`.`id` = `grupos_usuarios`.`usuario_id`
WHERE `grupos_usuarios`.`usuario_id` = 4997
GROUP BY `grupos`.`nome`
) CI_count_all_results
SELECT `grupos_usuarios`.`id` AS `principal_id`, `grupos`.`id` AS `grupo_id`, `grupos`.`nome`, `grupos`.`descricao`
FROM `grupos_usuarios`
JOIN `grupos` ON `grupos`.`id` = `grupos_usuarios`.`grupo_id`
JOIN `usuarios` ON `usuarios`.`id` = `grupos_usuarios`.`usuario_id`
WHERE `grupos_usuarios`.`usuario_id` = 4997
GROUP BY `grupos`.`nome`
 LIMIT 5